# SpatialElementDomainData Class

---
A base class for specific domain requirements for a spatial element.
SystemObject Autodesk.Revit.DBSpatialElementDomainData Autodesk.Revit.DB.ElectricalElectricalLoadAreaData
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class SpatialElementDomainData : IDisposable

    Public Class SpatialElementDomainData
    	Implements IDisposable

    public ref class SpatialElementDomainData : IDisposable

    type SpatialElementDomainData =
        class
            interface IDisposable
        end
The SpatialElementDomainData type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the SpatialElementDomainData
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace